app/controllers/api/v2/candidateapi_controller.rb

            def index
                candidate_details = CandidateDetail.order('created_at DESC');
---
SELECT "candidate_details".* FROM "candidate_details" ORDER BY created_at DESC

            def show
                candidate_detail = CandidateDetail.find(params[:id])
---
SELECT "candidate_details".* FROM "candidate_details" WHERE "candidate_details"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

            def create
                candidate_detail = CandidateDetail.new(candidate_detail_params)

                if candidate_detail.save
---
INSERT INTO "candidate_details" ("first", "last", "email", "phone", "degree", "marks", "experience", "platform", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"