app/controllers/candidate_details_controller.rb

SELECT "candidate_details".* FROM "candidate_details"
---
  def index
    @candidate_details = CandidateDetail.all

INSERT INTO "candidate_details" ("first", "last", "email", "degree", "platform", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["first", ""], ["last", ""], ["email", ""], ["degree", ""], ["platform", ""], ["created_at", "2020-11-06 12:00:31.560426"], ["updated_at", "2020-11-06 12:00:31.560426"]]
---
  def create
    @candidate_detail = CandidateDetail.new(candidate_detail_params)

    respond_to do |format|
      if @candidate_detail.save

UPDATE "candidate_details" SET "updated_at" = $1 WHERE "candidate_details"."id" = $2  [["updated_at", "2020-11-06 10:59:04.750988"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @candidate_detail.update(candidate_detail_params)

DELETE FROM "candidate_details" WHERE "candidate_details"."id" = $1  [["id", 3]]
---
  def destroy
    @candidate_detail.destroy

SELECT "candidate_details".* FROM "candidate_details" WHERE "candidate_details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_candidate_detail
      @candidate_detail = CandidateDetail.find(params[:id])